{"py/object": "realestate_com_au.objects.listing.Listing", "id": "140082187", "badge": null, "url": "https://www.realestate.com.au/property-unit-qld-wellington+point-140082187", "suburb": "Wellington Point", "state": "Qld", "postcode": "4160", "short_address": "1/6 O'Connell Parade", "full_address": "1/6 O'Connell Parade, Wellington Point, Qld 4160", "property_type": "unit", "price": null, "price_text": "Stunning Apartment!", "bedrooms": 3, "bathrooms": 2, "parking_spaces": 2, "building_size": "171.8", "building_size_unit": "m²", "land_size": -1.0, "land_size_unit": null, "listing_company_id": "YMXLIP", "listing_company_name": "Bayside Property Agents", "listing_company_phone": "0432447047", "auction_date": null, "available_date": null, "sold_date": null, "description": "A HOME AMONG THE GUM TREES.<br/>A serene destination surrounded by a lush rainforest canopy, bordered by Moreton Bay waterways with views to the islands awaits your arrival.<br/>Welcome home to the start of your next chapter in a pristine luxury paradise. This exclusive offering of seven boutique luxury residences with breathtaking views will be available for a limited time only. These residences have been designed with the utmost attention to detail, and offer stunning views of the surrounding leafy landscapes. Each residence is appointed with the finest finishes and fixtures, and are also available in a variety of floor plans. The development offers a sense of community and togetherness, whilst also providing ample opportunity for privacy and solitude.<br/><br/>Residence One - $1,349,000<br/>Residence Two - $1,349,000<br/>Residence Three - $1,639,000<br/>Residence Four - $1,639,000<br/>Residence Five - $1,849,000<br/>Residence Six - $1,849,000<br/>Residence Seven [Penthouse] - POA (Enquire Within)<br/><br/>The Redlands are renowned for their natural beauty, and nestled in the heart of this stunning landscape is the perfect setting for a luxurious escape. The lush surrounds provide a tranquil haven to relax and rejuvenate. The property is a sanctuary of peace and tranquillity, offering the ultimate in luxury living. With your own private lift entrance, the residences are perfectly situated for those who appreciate privacy and exclusivity. CanopySix is also within easy reach of all the amenities that the Redlands has to offer, making it the perfect place to call home.<br/>Featuring Eastern Bay views with luxurious amenity never before seen in the Redlands; the residences have been designed with an emphasis on comfort and style, with generously-sized rooms and high-end finishes throughout. Floor-to-ceiling windows provide an abundance of natural light, while also framing the incredible views of Moreton Bay. Whether you are watching the sunset from the spacious terraces or entertaining friends and family in the expansive living areas, CanopySix will provide you a lifestyle that is second-to-none.<br/><br/>Set your watch to family time and take part in a community that cares for each other. Wellington Point is a beautiful community that offers residents the opportunity to downsize and retire in style. The community is located in the Redlands, a region known for its stunning natural beauty. In addition to its physical charms, Wellington Point is also a close-knit community that cares for its members. Residents have the opportunity to spend time with their family and friends, and they can also get involved in a variety of social activities. Whether you're looking for a quiet place to retire or a vibrant community to call home, Wellington Point is the perfect choice.<br/><br/>From travertine stone tiles to Corsica oak flooring and brass fixtures, this is the home you deserve. The attention to detail in this luxury residence development is unparalleled. From the materials used, all of<br/>which have been chosen with care and purpose; right down to every last detail being finished by expert hands<br/>- CanopySix will stand the test of time as a one-of-a kind masterpiece known across the Redlands.<br/><br/>Embrace your nature and enjoy Enjoy the spoils of picturesque bayside living.There's something special about living near the water. Maybe it's the way the sunlight sparkles on the waves, or the sound of the gulls crying overhead. At CanopySix, not only do you get to enjoy all of the benefits of living by the water, but you also get to experience some of the most beautiful scenery in the world. From picturesque bays and coves to majestic cliffs and rugged coastline, there's always something new to explore. For those who are lucky enough to call CanopySix home, fresh oysters and fish are just waiting to be caught, and the raw beauty of the coast is minutes away. From fresh seafood to beautiful beaches, there's no shortage of reasons to love bayside living.<br/><br/>Whether you're looking to escape the hustle and bustle of city life or simply to re-connect with nature, CanopySix is the perfect destination for your next chapter<br/><br/>*Please note that renders are all taken from the Penthouse Level, these do not indicate the views from each level. Please contact us for the views at each level.", "images": [{"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/f42fdc21d2e01f320ddb41d75935e36573eca4bcb9ba59faca6e9506ab4a016c/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/a482e13d4da3f07f0b2ea38af7255f063c6e08935fc9d60ccb4a4046aa855a29/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/718efd423e86b649c689d91862bef8d30febaf3b2952b4ec08d6db6dbe1879f6/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/e5047a5397d4bd38553b1dbf56683d7c580e31ea6bd0a3a934b67d303880f81a/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/0fcb6f2ec3b1446d9153f2967042ee2d1c5023367302c0257eb8b9a0f6203e92/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/642c6f63e304150bbe30858d3151c1bcc5ddc1a13a10e7ab28c3b2708f4a33e4/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/075817a3f31a1f461e89159816e300a72fe9d001c310710c2dfd4cb96f2f454a/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/bf6793153d3bd68116fe791635b741afb78180363446dac002ca8b585a5c18dd/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/a042d231362485b97da631abf39f4c31d075a8f7d0bd3e79c85fbd04f079776c/image.jpg"}], "images_floorplans": [{"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/9d92164891e780f9327cf2a2fa76ea9882957e28f25c447ee93c33347135add0/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/34461cd3adcf65231f346fa504cc8f7ea16baeeb4d48aa0e446f08b4a7212170/image.jpg"}], "listers": [{"py/object": "realestate_com_au.objects.listing.Lister", "id": "2820054", "name": "Luke Humphrys", "agent_id": "c500f113-3535-49eb-9c88-b21dc7ef53b7", "job_title": "Selling Principal", "url": "https://www.realestate.com.au/agent/luke-humphrys-2820054?cid={cid}", "phone": "0432447047", "email": null}, {"py/object": "realestate_com_au.objects.listing.Lister", "id": "2820366", "name": "Justin Yip", "agent_id": null, "job_title": "Licenced Real Estate Agents", "url": "https://www.realestate.com.au/agent/justin-yip-2820366?cid={cid}", "phone": "0401506427", "email": null}], "inspections": []}