{"py/object": "realestate_com_au.objects.listing.Listing", "id": "140077759", "badge": null, "url": "https://www.realestate.com.au/property-house-qld-curra-140077759", "suburb": "Curra", "state": "Qld", "postcode": "4570", "short_address": "91 Clarkson Drive", "full_address": "91 Clarkson Drive, Curra, Qld 4570", "property_type": "house", "price": 1250000, "price_text": "Offers From $1,250,000", "bedrooms": 5, "bathrooms": 3, "parking_spaces": 11, "building_size": null, "building_size_unit": null, "land_size": 1.0, "land_size_unit": "ha", "listing_company_id": "GXENRW", "listing_company_name": "Bambling Property - GYMPIE", "listing_company_phone": "0754823666", "auction_date": null, "available_date": null, "sold_date": null, "description": "Picture yourself, your family, and friends here!  This huge, steel frame, modern, executive style, brick veneer home is only just over 2-year-old and will easily accommodate the largest of families, whilst still offering even more comfort and hospitality for extended family, or friends! <br/>Sitting proudly on a fully fenced, flat to gentle sloping 2.5-acre block, this home has been designed to capture breezes, mountain views, and offer excellent privacy. With the added bonuses of a shed, carports, garages, solar, pool, the potential for dual living or subdivision (STCA) and more, this property is “The One” to inspect!<br/><br/>Please watch the property video in 4K HD!<br/><br/>Property features:<br/><br/>•\t1Ha, 2.471052 (2.5) acres, or 10,000m2 of land, in an elevated position with mountain views, breezes, and a great outlook.<br/>•\tNeat and tidy, no -through neighbourhood, only a few minutes to the local roadhouse, chemist, country club, and more.<br/>•\tFully fenced (dog proof), with gated dual driveways, easy vehicle access in and out, also suitable for heavy vehicle turnaround.<br/>•\tEasy vehicle and machine access to all garages, carports, shed and yard.<br/>•\tLandscaped with rock hardstand, off-road guest or family parking, and established gardens. <br/>•\tHuge 2-year-old, modern, executive style, steel frame, brick veneer home, with quality fittings and Colourbond roofing. <br/>•\tAll constructed and completed by local builder and tradespeople.<br/>•\tThe amazing home boasts 5 bedrooms, 3 bathrooms, and 3 garages. All bricked in under roof.<br/>•\tThe formal entry with decorative display pillars and high ceilings invites you into the overwhelmingly large, open plan living area, fit for the largest of families or gatherings.<br/>•\tOpen plan living, lounge, and dining, open out through custom sliding doors to expansive outdoor entertaining options.<br/>•\tLarge 2nd living/media/rumpus room, with coffered square-set ceiling, downlighting, timber barn- style roller doors, opening to both the living, and formal entry, provides space for the family to retreat or relax. <br/>•\tAt the centre of the home the beautifully planned and appointed kitchen features a long island bench with granite stone bench top, granite waterfall end, breakfast bar, double sink, modern pendant feature lighting, marble tile splashback, large chef style, 5-burner gas cooktop with oven and grill, fully shelved and equipped butlers’ pantry, fully plumbed fridge, an extra wall mounted oven, 2 convection ovens/built in microwaves, dishwasher, ducted rangehood, and pantry.<br/>•\tButlers’ pantry features, double sink, marble tiled splashback, granite stone benchtop, cupboards, drawers, bin space, and hopper window.<br/>•\tUpgraded features and fittings throughout include tinted and strengthened windows, lockable security screens and doors, roll down block out blinds, ceiling fans, slimline switches and power points, mirror and glass sliding cupboard doors, energy efficient LED lighting, durable and modern timber look vinyl planking, 2700mm high ceilings, rectified tiled wet areas, and granite benchtops throughout.<br/>•\t5 large bedrooms feature built in robes, and ceiling fans.<br/>•\tThe 5th bedroom has external access to a front patio and makes an excellent home office option.<br/>•\tSmaller front patio, with sliding door entry to 5th bedroom/ home office option.<br/>•\tLarge undercover rear patio with outdoor fans, view of the nearby mountain ranges, and visibility over the whole property including the shed and pool.<br/>•\tThe elegant and oversized master suite features, ambient pendant lighting, wooden look ceiling fan, TV point, sliding doors to yard and undercover entertaining, walk in wardrobe, and opulent ensuite.<br/>•\tThe walk-in wardrobe is spacious and has been customised to accommodate your needs with adjustable timber shelving and hanging space.<br/>•\tThe ensuite features 600 x 300 Italian-style, rectified floor-to-ceiling tiling, heating and extraction, frameless mirror, feature pendant lighting, double size shower with dual function, secondary rainmaker shower head, niches, deep full-size freestanding bath, twin custom vanities with granite stone benchtop, and WC.<br/>•\tThe second family bathroom features, floor to ceiling rectified tiling, wall hung custom vanity with granite stone bench top, frameless mirror, shower with niche, full size bath with hob, feature light, and separate WC. <br/>•\tThe third guest bathroom features, floor to ceiling rectified tiling, shower, niche, single custom vanity with granite stone benchtop, WC, and built-in linen cupboard with glass sliding doors.<br/>•\tThe laundry is situated on the side of the home with quality floor tiling, shelved cupboards with glass sliding doors, a laundry tub/sink, tiled splashback, and has convenient access to the yard and clothesline.<br/>•\tThe bricked in, 3-car-garage features, automatic roller doors, workshop, storage space, and/or, 3 vehicle accommodation.<br/>•\tA large 24m x 8m shed consists of a, 6m x 8m carport with excellent driveway accessibility, 8m x 8m insulated garage with 2 x roller doors, a further 16m x 8m “mancave”/rumpus room/ sleepout that’s lined and insulated with TV point, and an adjoining 3m x 20m lean to, providing extra carport accommodation for up to 4 vehicles and undercover poolside entertaining options. <br/>•\t11m x 4m inground saltwater pool with, heater, timer, sand filter, robotic cleaner, pool cover on roller, and large fully fenced surrounds. <br/>•\t3 x 5,000-gallon poly water tanks, UV water- dual filtration system to all property plumbing, and several external yard taps.<br/>•\t20KW, 8 zone, fully- ducted air conditioning, NBN connected.<br/>•\tHard-wired home security system with integrated control from mobile devices.<br/>•\t3-phase power, 6.5 KW solar system, and 2 x solar hot water systems (ensuite has its own unit).<br/> <br/>91 Clarkson Drive has got the lot and is the complete lifestyle package! <br/><br/>Situated only a few minutes from the local service station, chemist, park with playground, and the Curra Country Club, and only a further 10–15-minute drive to Gympie CBD, offering quality public and private schools, cafes, restaurants, shopping centres and more.  <br/><br/>The property is also centrally located just over an hour from Rainbow Beach, Tin Can Bay, and Noosa Heads, an hour and 15 minutes to the Sunshine Coast airport, and just over 2 hours to Brisbane’s international airport. <br/><br/>Positioned in a no through road, safe and quiet neighbourhood, with quality neighbouring properties, families will feel safe and welcomed to the area.<br/>There is easy access within minutes to the Bruce Highway and local service roads for North and South bound travel, making commuting to work options, and weekend day trips to surrounding beaches and townships, dams, state forests, and wine regions, all too easy!<br/><br/><br/>Disclaimer<br/>All the above property information has been supplied to us by the Vendor. We do not accept responsibility to any person for its accuracy and do no more than pass this information on. Interested parties should make and rely upon their own enquiries in order to determine whether or not this information is in fact accurate. Intending purchasers should seek legal and accounting advice before entering into any contract of purchase.<br/>", "images": [{"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/f27d2f9ee5db58c215cbee8e7b01d3d2f280f05a3e7126a8dccf554cfc3ba96a/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/f19f3430fe688584772ef3dc76e1aa60c98575d7977233cea5569558666490e4/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/8ea9621f1504c115c0014edd5306f0a875bfa386d94b158e447afa8237f035d2/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/3093508b5e1f50132a733abc8caad8c7defea648ce296d7328b9a12e1807b467/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/20f4624e3280ff051e8622ee041c658b1faa2de1fd22a6206627713f6559039b/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/5f7b13a501bf984dee18cdad829b9bb40879b5fbfe282efc7351d1c749c03a50/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/e37e78007933bde426a3920140ef9220ce8cab473a913887a5c5201d184b0311/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/42e3c58df3cedfa71ff5ee0c416d17b5793a7940ae9f361ad17868831e4283bf/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/9782a93b470ac5eccc9ff7fc80a48f4a50a40e5ae317febee7693fd4e02f11f2/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/f1908dcde6f05742b0df75247134293044d5e508fc9cff6f9e7d099651685990/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/57ee89ea0824c9e67be6a157be37f17c52a603a055dd0f2d413beb3d4b756a4b/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/86cbf78f43a0eddd64dbe79058c3fab3574c957797251a9740cd26f2cbf93420/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/e420637359a6004d4ea20e83d1429baa2a3e04e685b86b205dba2a479c5d7629/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/a44b6c462693c978e2efab6ec4e2e7dd7549e1e2f12a0601233db104b2694d0c/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/c4a8980cc35b327be23c0358e083495d723c8cd8dac655af904b44e532cc17a2/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/551ae483e3d8f1cefbb95d9fe5f684b1e50e6110904a66ba5143ef003d3f62ec/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/89a7648548a7bdbea2bfc954668029fdb9bb91a6b744a5800bf2f5563e4848ed/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/26d5b89d926d99570bf32515be457ffa7e30bd18c4a3690fe23d2869bf6c14ad/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/91fc3839186f4987be7f63c2e59a17a471f8e91a6bb31129b15ed1b2f0eae8d7/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/f7fb173c656c45df84b34307e279172a54614426103d9514bf696f34979dda03/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/5c4e92b497ec74b964f57906698515492e98a80ee814887baaa7924f61e0cdd4/image.jpg"}], "images_floorplans": [{"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/2abe5b964823d1975051b50ced92271f9fb2466e65304fe1e1657d9937f933ff/image.jpg"}], "listers": [{"py/object": "realestate_com_au.objects.listing.Lister", "id": "1113839", "name": "John McEwan", "agent_id": null, "job_title": "Sales Consultant", "url": "https://www.realestate.com.au/agent/john-mcewan-1113839?cid={cid}", "phone": "0413198385", "email": null}], "inspections": []}