{"py/object": "realestate_com_au.objects.listing.Listing", "id": "140820807", "badge": null, "url": "https://www.realestate.com.au/property-house-nsw-kingscliff-140820807", "suburb": "Kingscliff", "state": "NSW", "postcode": "2487", "short_address": null, "full_address": null, "property_type": "house", "price": null, "price_text": "CONTACT AGENT", "bedrooms": 5, "bathrooms": 3, "parking_spaces": 2, "building_size": null, "building_size_unit": null, "land_size": -1.0, "land_size_unit": null, "listing_company_id": "CVODSP", "listing_company_name": "New Tweed Coast Real Estate Group - KINGSCLIFF", "listing_company_phone": "0430735899", "auction_date": null, "available_date": null, "sold_date": null, "description": "Quality, on-trend renovations influenced by modernist European design depicts this highly detailed single-level family home in the desirable creekside enclave of Kingscliff Hill.<br/><br/>Its impressive visual aesthetic of geometric forms, neutral palettes and organic materials is equally matched by a functional floor plan, lifestyle appointments and connectivity with the outdoors.<br/><br/>A custom arched oak front door makes for a visually dynamic entrance to the residence of white brick, vertical battens, Oslo stone and cascading gardens.<br/><br/>Considered interiors of Otsumigaki clay plastered feature walls, travertine cobbles and curved portals deliver modern yet timeless appeal to the 246m2 floor plan.<br/><br/>Wide European oak floorboards imbue warmth to the light-filled open lifestyle space comprising a generous living room, dining area and designer kitchen appointed a butler’s pantry, custom island dining bar, stone benchtops, 900mm gas cooktop, two dishwashers and soft-close cabinetry.<br/><br/>Gliding glass ensures seamless connectivity with the vast sun deck with space for open-air alfresco dining. It wraps around the saltwater plunge pool and overlooks the integrated stone fire pit with custom curved bench seating ahead of manicured lawns and mature olive trees.<br/><br/>Sheer window dressings soften the privately winged master bedroom detailed with circular wall sconces, a dressing room, and deluxe ensuite with a double vanity, twin shower and arced mirrors.<br/><br/>There are three dedicated guest bedrooms with built-in wardrobes, two main bathrooms, and the convenience of two multi-purpose rooms with outdoor access suitably placed for use as additional bedrooms, a home office, yoga studio, games room, media lounge or rumpus room.<br/><br/>Additional conveniences include a mudroom-inspired travertine foyer, wireless security, air conditioning, oversized Velux skylights, and new quality Bradnam windows and doors. Positioned just metres from Cudgen Creek in a quiet address, this immaculate, low-maintenance and newly renovated residence is just a short walk from schools, shops and the beach.<br/><br/>- Level block in quiet street edging Cudgen Creek<br/>- Newly renovated, single-level residence of 246m2<br/>- Saltwater plunge pool, vast sun deck, integrated fire pit<br/>- Open lifestyle space; custom kitchen has butler’s pantry<br/>- Master bedroom with dressing room and couples ensuite<br/>- Two multi-purpose rooms, mudroom, double carport<br/>", "images": [{"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/6a35c5a42a1d06c817560ffca90b8c42ee0c319bebd84127dd23db47da046a53/image.jpg"}], "images_floorplans": [], "listers": [{"py/object": "realestate_com_au.objects.listing.Lister", "id": "2205398", "name": "Chris Hall", "agent_id": "64ecf5b4-438c-4573-8325-675a7bdd4e6e", "job_title": "Licensed Real Estate Agent", "url": "https://www.realestate.com.au/agent/chris-hall-2205398?cid={cid}", "phone": "0423563480", "email": null}, {"py/object": "realestate_com_au.objects.listing.Lister", "id": "2621530", "name": "Greg Costello", "agent_id": "64e7f58e-a3ce-46fe-af67-bb646946c24d", "job_title": "Licensed Real Estate Agent", "url": "https://www.realestate.com.au/agent/greg-costello-2621530?cid={cid}", "phone": "0402284124", "email": null}], "inspections": []}