{"py/object": "realestate_com_au.objects.listing.Listing", "id": "141138976", "badge": null, "url": "https://www.realestate.com.au/property-house-qld-hamilton-141138976", "suburb": "Hamilton", "state": "Qld", "postcode": "4007", "short_address": "10 Ludlow Street", "full_address": "10 Ludlow Street, Hamilton, Qld 4007", "property_type": "house", "price": null, "price_text": "Best Offers By Wednesday 25th January 3pm", "bedrooms": 4, "bathrooms": 4, "parking_spaces": 5, "building_size": null, "building_size_unit": null, "land_size": -1.0, "land_size_unit": null, "listing_company_id": "PRNASC", "listing_company_name": "Place - Ascot", "listing_company_phone": "0731076888", "auction_date": null, "available_date": null, "sold_date": null, "description": "Expertly crafted by multi-national award-winning Zephyr Industries, 'Soror' on Ludlow is a newly constructed and architecturally brilliant statement residence positioned privately on Hamilton hill amongst the postcode's finest homes, capturing mesmerising views of Brisbane's river and city skyline. Magnificently spread over three comprehensively equipped and luxurious levels providing the absolute pinnacle in living and entertaining, this tremendous hilltop home makes no compromise and is arguably the finest offering of its kind currently available within inner-city Brisbane.<br/><br/>At a glance, attributes of 'Soror' include but are not limited to:<br/>- Brand new build architecturally designed by 'The Artificial' and constructed by multi-national award-winning Zephyr Industries <br/>- Supreme river and city skyline views minus the harsh Western sun courtesy of a sought-after North-South facing orientation<br/>- Approx. 580m2 of house occupying an elevated and private blue-chip allotment set within Brisbane's most prestigious and exclusive hilltop enclave<br/>- Meticulously crafted, luxuriously appointed and comprehensively equipped hilltop home, exceptionally finished and idyllically designed<br/>- Four generous bedrooms each complete with private ensuites and either walk-in-robe or spacious built-ins, most enjoying north-facing windows<br/>- Opulent master retreat featuring spectacular his and hers walk-in-robe, large en suite with dual vanity and private terrace with panoramic views<br/>- Four beautiful bathrooms plus powder room conveniently positioned nearby to the home's various living, entertaining and bedroom zones <br/>- State of the art kitchen plus butler's pantry with striking centrepiece stone island bench, Gaggenau integrated appliances and ample storage<br/>- Entertainers, executives and families will adore the seamless interactivity between kitchen, dining and indoor/outdoor living areas on main level<br/>- Expansive alfresco entertaining space adjacent to kitchen area features in-built BBQ, Vintec drinks fridge and integrated speakers<br/>- Jaw dropping infinity edge pool with adjacent flat astro-turfed yard positioned front and centre to capture expansive city skyline and river outlook<br/>- Temperature controlled, dehumidified wine cellar featuring double glazed internationally imported glass and display racking for approx. 800 bottles<br/>- Extremely rare and highly sought after oversized basement garage fit to house numerous vehicles on ground plus infrastructure for car stackers<br/>- Sizeable mezzanine level installed within basement currently featuring skateboard halfpipe ramp, enjoy as is or re-purpose as required<br/>- Lift servicing all levels, elegant and striking dark colour palette throughout, quality finishes and fixtures, low maintenance landscaping<br/>- Smart wiring enabling remotely controllable high-tech security, speakers, wall-mounted TV's, A/C and electric blinds from anywhere in the world<br/>- Ascot State School catchment and nearby to prestigious private schooling, circa 5km's from Brisbane's CBD<br/><br/>Surrounded by some of Brisbane's finest residences and prestigious schooling options, the calibre of this location is unquestionable. Positioned within the Ascot State School and Aviation High catchments and within near proximity to St.Margaret's, St.Rita's, Clayfield College and St.Agatha's private schools with Brisbane Grammar, Brisbane Girls Grammar, St.Joseph's Nudgee College, St.Joseph's College Gregory Terrace and Churchie also within arm's length. A short distance to local green space including Crosby Park next door to Brothers Rugby Club and Albion's burgeoning retail and café precinct, Ascot Park on the doorstep of Eagle Farm Racecourse and Oriel Park featuring the adjoining plus newly renovated Oriel Markets shopping village. Moments to locally renowned Racecourse Road and the Portside precinct beyond where you are spoilt for choice with cafes, restaurants and boutique shops. For destinations further afield, journey via nearby public transport options, otherwise a short drive to Newstead Gasworks, James Street, Brisbane Airport and the city.<br/><br/>For further information or to arrange a viewing, please contact Drew Davies on 0421 078 273 or Carter Lagana on 0490 020 954.<br/><br/>Disclaimer: <br/>We have in preparing this advertisement used our best endeavours to ensure the information contained is true and accurate, but accept no responsibility and disclaim all liability in respect to any errors, omissions, inaccuracies or misstatements contained. Prospective purchasers should make their own enquiries to verify the information contained in this advertisement.", "images": [{"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/b5163f598ae29e86a8523a87c81244afaff2ffeefd0519e7bbcfe6c6728c4121/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/76b1df08bc0135d7216dd9bdfc7f571394dbfe85b86ef8e83daddb48ae943515/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/337d4d8746975d9ee4c1c0b3a4ac3cf3069c5de28760002ccd77cdf8506f5b26/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/d534ad09d09bfa30fb9cec017f5c356365a49a9404f60ab9677032ae797b30c5/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/2256268235340fd5ffda415723eb15d44f2937d6789d89c7f6594aa3f360a460/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/444a190695bd983379554efcd2fee2905ce5d0ad7fabe2e480730d9be5be39e7/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/1465014d2028f1a971f7aafbd10271ae0bb372cb9484601162c6eddc50ead9b2/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/6f1025f5d15811930446a60ad75e0014cfd09da6bc9ea8de384cdbde79021327/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/3e8d692ae3cbbbe8eda00d1f63ee7ffcdc3f6076c21a03380218a1d22aee0247/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/9f986f36590e2e60284a3aade4eca199a83eb77ec89312e920a8dbf90c11aed6/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/828a8f58b9b122a367fef517ad40381da7dd6ab7b25a04aec1951f02c804ce0c/image.jpg"}], "images_floorplans": [], "listers": [{"py/object": "realestate_com_au.objects.listing.Lister", "id": "2334722", "name": "Drew Davies", "agent_id": "45bb6a89-61d6-4335-a6bd-4b7bf492da6f", "job_title": "Principal/Director", "url": "https://www.realestate.com.au/agent/drew-davies-2334722?cid={cid}", "phone": "0421078273", "email": null}, {"py/object": "realestate_com_au.objects.listing.Lister", "id": "2599170", "name": "Carter Lagana", "agent_id": null, "job_title": "Lead Agent", "url": "https://www.realestate.com.au/agent/carter-lagana-2599170?cid={cid}", "phone": "0490020954", "email": null}], "inspections": [{"py/object": "realestate_com_au.objects.listing.Inspection", "start_time": "2023-01-22T11:00:00+10:00", "end_time": "2023-01-22T11:30:00+10:00", "label": "Open tomorrow 11:00am", "label_short": "Open tomorrow"}]}