{"py/object": "realestate_com_au.objects.listing.Listing", "id": "141173832", "badge": null, "url": "https://www.realestate.com.au/property-unit-qld-maroochydore-141173832", "suburb": "Maroochydore", "state": "Qld", "postcode": "4558", "short_address": "8/17 Bradman Avenue", "full_address": "8/17 Bradman Avenue, Maroochydore, Qld 4558", "property_type": "unit", "price": null, "price_text": "Price on Application", "bedrooms": 3, "bathrooms": 3, "parking_spaces": 3, "building_size": "237", "building_size_unit": "m²", "land_size": -1.0, "land_size_unit": null, "listing_company_id": "XYLSOK", "listing_company_name": "Your Property Co. - MAROOCHYDORE", "listing_company_phone": "0417715646", "auction_date": null, "available_date": null, "sold_date": null, "description": "RIVIERE on Bradman offers luxury personified.  Direct lift access, highest quality finishes, natural light throughout and a large 237m2 floor plan, Riviera on Bradman Avenue offers world class riverfront perfection. <br/><br/><br/>The Design: <br/><br/>Architecturally designed with just two apartments per level, RIVIERE has the advantage of natural light all through the apartments as well as at the front and rear balconies.  Sitting perfectly North facing, with arguably the best river view available along Bradman Avenue, the large open plan living area has been designed to take in the ever-changing riverscape. <br/><br/> <br/><br/>The Features: <br/><br/>Construction to commence early 2023 <br/><br/>Boutique owner occupier building of only eight high end residences <br/><br/>Only 2 Apartments per floor with direct, secure lift access <br/><br/>Perfect North facing position with arguably the best Bradman Avenue view line. <br/><br/>Entertainers' kitchen with separate drinks/coffee bar <br/><br/>Butler's Pantry with additional storage <br/><br/>Three large bedrooms, with the master enjoying river views <br/><br/>Master with WIR & Ensuite <br/><br/>Designated media or study with balcony access <br/><br/>Lavish ensuite, generous main bathroom and separate laundry <br/><br/>Ducted air conditioning throughout <br/><br/>Large 30+m2 balcony with Built in BBQ <br/><br/>Luxurious appointments including bespoke cabinetry, stone bench tops and high-quality appliances <br/><br/>Two/Three car accommodation with storage <br/><br/>Lap Pool, BBQ area and sundeck <br/><br/>Low outgoings <br/><br/><br/><br/> <br/><br/>The Finishes: <br/><br/>RIVIERE - Luxury Coastal Living; the combination of stone finishes and light cabinetry provides the perfect blend of coastal whilst still creating a luxury feel. With a view line so prominent, there is a heavy use of windows to capture the ever-changing riverscape which also ensures an abundance of natural light throughout the day.  <br/><br/>The Complex: <br/><br/>RIVIERE is just four storeys high, with each floor accommodating only two apartments. The secure basement will cover all your car parking and storage needs and the large communal area toward the rear of the complex, offers an entertaining area, with a swimming pool and BBQ area. With direct secure lift access and security throughout, the complex is safe, secure and makes for the perfect downsizer lifestyle.  <br/><br/> <br/><br/>The Position:  <br/><br/>Situated at the very start of Bradman Avenue, RIVIERE offers easy access to Maroochydore CBD and is within easy walking distance to Ocean Street Dining, Cotton Tree precinct and the Sunshine Plaza.   <br/><br/>Bradman Avenue continues to undergo a regeneration program, with the introduction of footpaths, cycleways, and additional vegetation.  The newly created Bradman Beach is directly opposite RIVIERE and is easily accessible following the meandering footpath along the canal to the river.  it is no wonder this section of Bradman Avenue has become a hot spot for locals to enjoy the lifestyle of the Sunshine Coast. Jog, walk or cycle along the river, explore Chambers Island or simply meet with friends and enjoy a coffee and relax. <br/><br/>RIVIERE is perfectly positioned to connect you with the serenity of a riverside living, with the water's edge and sandy beach just footsteps away. <br/><br/>The Area:  <br/><br/>Situated at the very start of the Maroochydore end of Bradman Avenue, RIVIERE has the best of both worlds.  Wake up to the glistening, tranquil riverfront while remaining close to the region's fast growing commercial, retail and business precinct. <br/><br/>Maroochydore is the centre of the Sunshine Coast. With the new addition of the Suncentral CBD (first smart city of Australia) creating exciting green spaces and a city like skyline, coupled with the very sought-after Rivers and Beaches, it is no wonder the spotlight sits right on the heart of Maroochydore. Being just minutes from the new International Airport gives you the advantage of working remotely, from your wow factor balcony and having quick access to all the major cities, nationally and internationally. Want to know more about the finished CBD, click below: <br/><br/> <br/><br/>https://www.maroochydore-city.com.au/ <br/><br/><br/><br/>The Offer: <br/><br/>On offer is the new lifestyle you have been seeking. Contemporary design with an architecturally designed floor plan ensures that every amenity and convenience has been considered as the open planned living design simply enhances your lifestyle. This luxury residence, RIVIERE, incorporates secure, direct lift access into your residence, two/three car parking and storage, enabling you to easily enjoy the riverfront lifestyle to its maximum.<br/><br/><br/>Disclaimer: This property is being sold without a price and therefore a price guide cannot be provided. The website may have filtered the property into a price bracket for website functionality purposes.", "images": [{"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/75f8a8b41d64566dc094eac79ed6696611330a5a15f1fb5f5e779f7a0591a915/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/a0b2402f3820910dcedc1ae07819e9468e7075372d1c90c6811d425bcc6208a6/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/2fa8dbfdfbf34cc6d13476c9e79cd996790885e01a6bea84e765d44210711ee4/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/a524c583009cf511626538c922a4abafb1fd01fd7b78807a22cce78d3b5bdfed/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/2cca98be4edac4e17589c1a9ca9940691e2596dfe7ddaf2ef341e07107b28d46/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/374cbc50987425cb846ba36e02b242bfb04774dd7157a14597c745c4b49bbbf9/image.jpg"}, {"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/c05d633741db9d15ff522cd2f05ff4b9826deea1b7627d2dca9e75c5e8c9c938/image.jpg"}], "images_floorplans": [{"py/object": "realestate_com_au.objects.listing.MediaItem", "link": "https://i2.au.reastatic.net/1144x888-format=webp/5f09331bc93f560480135720d7571bd90adb3de179280840863805e8cccbc23a/image.jpg"}], "listers": [{"py/object": "realestate_com_au.objects.listing.Lister", "id": "2631766", "name": "Shannon Beavis", "agent_id": null, "job_title": "Director, Lead Agent & Projects Consultant", "url": "https://www.realestate.com.au/agent/shannon-beavis-2631766?cid={cid}", "phone": "0417715646", "email": null}], "inspections": []}